# 总共有RGBT_Stem RGBT_Conv RGBT_C3k2 GBT_SPDConv RGBT_SPPF CBAMFusion TransformerFusion
# 七个模块需要在 ultralytics/nn/modules/block.py 中写

nc: 10
ch: 4

scales:
  x: [1.00, 1.25, 1024]

backbone:
  - [-1, 1, RGBT_Stem, [64, 3, 2]]         # 0: P1 (Stride 2)
  - [-1, 1, RGBT_Conv,[128, 3, 2]]        # 1: P2 (Stride 4)
  - [-1, 2, RGBT_C3k2,[256, False, 0.25]] # 2:

  # --- 引入 SPD-Conv 解决 P3 阶段小目标像素丢失 ---
  - [-1, 1, RGBT_SPDConv, [256]]           # 3: P3 (Stride 8) <- 替换了普通Conv
  - [-1, 2, RGBT_C3k2, [512, False, 0.25]] # 4:

  # --- 引入 SPD-Conv 解决 P4 阶段像素丢失 ---
  - [-1, 1, RGBT_SPDConv, [512]]           # 5: P4 (Stride 16) <- 替换了普通Conv
  - [-1, 2, RGBT_C3k2, [512, True]]        # 6:

  - [-1, 1, RGBT_Conv,[1024, 3, 2]]       # 7: P5 (Stride 32) (P5不影响小目标，用标准Conv)
  - [-1, 2, RGBT_C3k2,[1024, True]]       # 8:
  - [-1, 1, RGBT_SPPF, [1024, 5, 3, True]] # 9:

  # --- 融合层：把“双层巴士”融合成“单层巴士” ---
  - [2, 1, CBAMFusion, [256]]              # 10: 接收元组，输出单张量
  - [4, 1, CBAMFusion, [512]]              # 11:
  - [6, 1, TransformerFusion, [512, 8]]    # 12:
  - [9, 1, TransformerFusion, [1024, 16]]  # 13:

head:
  # 注意：这里把 nearest 全部换成了 bicubic，对 Transformer 和微小目标更友好
  - [13, 1, nn.Upsample,[None, 2, "bicubic", True]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]]
  - [[-1, 10], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]                # 22: P2 输出头

  # --- 下采样阶段 ---
  - [-1, 1, Conv,[128, 3, 2]]
  - [[-1, 19], 1, Concat, [1]]
  - [-1, 2, C3k2,[256, False]]                # 25: P3 输出头

  - [-1, 1, Conv,[256, 3, 2]]
  - [[-1, 16], 1, Concat, [1]]
  - [-1, 2, C3k2,[512, False]]                # 28: P4 输出头

  - [-1, 1, Conv,[512, 3, 2]]
  - [[-1, 13], 1, Concat, [1]]
  - [-1, 2, C3k2,[1024, False]]               # 31: P5 输出头

  # 四头检测！完美覆盖 VEDAI 的微观目标和 DroneVehicle 的事故大货车
  - [[22, 25, 28, 31], 1, Detect, [nc]]        # 32