# YOLO26x-M Asymmetric Dual-Stream (RGB: X-Heavy, Thermal: M-Light)
# With P2 Head, SPD-Conv, and Transformer Fusion

#names: [car, truck, bus, motorcycle, pedestrian, pickup, tractor, camping_car, boat, plane, other]
nc: 11
ch: 4

scales:
  x: [1.00, 1.25, 1024] # 全局保持 X 的通道宽度

backbone:
  # 0: 数据分发站 (截留原始 4 通道)
  - [-1, 1, PassThrough, []]

  # ==========================================
  # 分支 A：RGB 主干 (完全对标 YOLO26x，深度为 2)
  # ==========================================
  - [0, 1, RGB_Stem,[64, 3, 2]]       # 1: P1 1024 -> 512
  - [-1, 1, Conv,[128, 3, 2]]         # 2: P2 256
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3: (厚度2) RGB P2 终点

  - [-1, 1, SPDConv, [256]]            # 4: P3 (无损下采样) 128
  - [-1, 2, C3k2,[512, False, 0.25]]  # 5: (厚度2) RGB P3 终点

  - [-1, 1, SPDConv, [512]]            # 6: P4 (无损下采样) 64
  - [-1, 2, C3k2, [512, True]]         # 7: (厚度2) RGB P4 终点

  - [-1, 1, Conv, [1024, 3, 2]]        # 8: P5 32
  - [-1, 2, C3k2, [1024, True]]        # 9: (厚度2)
  - [-1, 1, SPPF,[1024, 5, 3, True]]  # 10: RGB P5 终点 Spatial Pyramid Pooling - Fast 5*5的 maxpooling

  # ==========================================
  # 分支 B：Thermal 主干 (对标 YOLO26m，深度减半为 1)
  # ==========================================
  - [0, 1, Thermal_Stem, [64, 3, 2]]   # 11: P1
  - [-1, 1, Conv, [128, 3, 2]]         # 12: P2
  - [-1, 1, C3k2,[256, False, 0.25]]  # 13: (厚度1) Thermal P2 终点

  - [-1, 1, SPDConv, [256]]            # 14: P3
  - [-1, 1, C3k2, [512, False, 0.25]]  # 15: (厚度1) Thermal P3 终点

  - [-1, 1, SPDConv, [512]]            # 16: P4
  - [-1, 1, C3k2, [512, True]]         # 17: (厚度1) Thermal P4 终点

  - [-1, 1, Conv,[1024, 3, 2]]        # 18: P5
  - [-1, 1, C3k2, [1024, True]]        # 19: (厚度1)
  - [-1, 1, SPPF,[1024, 5, 3, True]]  # 20: Thermal P5 终点


head:

  # ==========================================
  # 融合层 (把 1-10 和 11-20 对应的层合并)
  # ==========================================
  - [[3, 13], 1, CBAMFusion, [256]]             # 21: 融合 P2
  - [[5, 15], 1, CBAMFusion, [512]]             # 22: 融合 P3
#  - [[7, 17], 1, TransformerFusion, [512, 8]]   # 23: 融合 P4
  - [[7, 17], 1, Swin_Transformer_Fusion, [512, 8, 4, 8]]   # 23: 融合 P4   ch,num_heads,depth,window_size
#  - [[10, 20], 1, TransformerFusion, [1024, 16]]# 24: 融合 P5
  - [ [ 10, 20 ], 1, Swin_Transformer_Fusion,[ 1024, 16, 2, 8 ] ]# 24: 融合 P5

  # --- 【Pyramid Shuffle 跨尺度洗牌】---
  # 将融合好的 22(P3), 23(P4), 24(P5) 打包送入洗牌模块
  # 参数说明：[输入层列表, 重复次数, 模块名, [目标尺度索引, 输出通道]]
  - [[21, 22, 23, 24], 1, PyramidShuffleLevel, [0, 128]]  # 25: 输出洗牌后的 Fused_P2
  - [[21, 22, 23, 24], 1, PyramidShuffleLevel, [1, 256]]  # 26: 输出洗牌后的 Fused_P3
  - [[21, 22, 23, 24], 1, PyramidShuffleLevel, [2, 512]]  # 27: 输出洗牌后的 Fused_P4
  - [[21, 22, 23, 24], 1, PyramidShuffleLevel, [3, 1024]] # 28: 输出洗牌后的 Fused_P5

  # ==========================================
  # FPN (自顶向下，传递 Transformer 的全局语义)
  # ==========================================
  - [28, 1, nn.Upsample, [None, 2, "bicubic", True]] # 29: 洗牌P5上采样
  - [[-1, 27], 1, Concat, [1]]                       # 30: 拼接洗牌P4 (1024+512=1536ch)
  - [-1, 2, C3k2, [512, False]]                      # 31: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]] # 32: FPN_P4上采样
  - [[-1, 26], 1, Concat, [1]]                       # 33: 拼接洗牌P3 (512+256=768ch)
  - [-1, 2, C3k2, [256, False]]                      # 34: FPN_P3

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]] # 35: FPN_P3上采样
  - [[-1, 25], 1, Concat, [1]]                       # 36: 拼接洗牌P2 (256+128=384ch)
  - [-1, 2, C3k2, [128, False]]                      # 37: FPN_P2 (最高清语义) -> **输入给检测头1**

  # ==========================================
  # PANet (自底向上，传递高清边缘细节)
  # ==========================================
  - [-1, 1, Conv, [128, 3, 2]]                       # 38: FPN_P2下采样
  - [[-1, 34], 1, Concat, [1]]                       # 39: 拼接FPN_P3 (128+256=384ch)
  - [-1, 2, C3k2, [256, False]]                      # 40: PAN_P3 -> **输入给检测头2**

  - [-1, 1, Conv, [256, 3, 2]]                       # 41: PAN_P3下采样
  - [[-1, 31], 1, Concat, [1]]                       # 42: 拼接FPN_P4 (256+512=768ch)
  - [-1, 2, C3k2, [512, False]]                      # 43: PAN_P4 -> **输入给检测头3**

  - [-1, 1, Conv, [512, 3, 2]]                       # 44: PAN_P4下采样
  - [[-1, 28], 1, Concat, [1]]                       # 45: 拼接洗牌P5 (512+1024=1536ch)
  - [-1, 2, C3k2, [1024, False]]                     # 46: PAN_P5 -> **输入给检测头4**

  # ==========================================
  # 终极 Quad-Head (四头检测)
  # ==========================================
  - [[37, 40, 43, 46], 1, Detect, [nc]]              # 47: P2, P3, P4, P5 完美输出！