# YOLO26x-M Asymmetric Dual-Stream (RGB: X-Heavy, Thermal: M-Light)
# With P2 Head, SPD-Conv, and Transformer Fusion

nc: 10
ch: 4

scales:
  x: [1.00, 1.25, 1024] # 全局保持 X 的通道宽度

backbone:
  # 0: 数据分发站 (截留原始 4 通道)
  - [-1, 1, PassThrough, [4]]

  # ==========================================
  # 分支 A：RGB 主干 (完全对标 YOLO26x，深度为 2)
  # ==========================================
  - [0, 1, RGB_Stem,[64, 3, 2]]       # 1: P1 1024 -> 512
  - [-1, 1, Conv,[128, 3, 2]]         # 2: P2 256
  - [-1, 2, C3k2, [256, False, 0.25]]  # 3: (厚度2) RGB P2 终点

  - [-1, 1, SPDConv, [256]]            # 4: P3 (无损下采样) 128
  - [-1, 2, C3k2,[512, False, 0.25]]  # 5: (厚度2) RGB P3 终点

  - [-1, 1, SPDConv, [512]]            # 6: P4 (无损下采样) 64
  - [-1, 2, C3k2, [512, True]]         # 7: (厚度2) RGB P4 终点

  - [-1, 1, Conv, [1024, 3, 2]]        # 8: P5 32
  - [-1, 2, C3k2, [1024, True]]        # 9: (厚度2)
  - [-1, 1, SPPF,[1024, 5, 3, True]]  # 10: RGB P5 终点 Spatial Pyramid Pooling - Fast 5*5的 maxpooling

  # ==========================================
  # 分支 B：Thermal 主干 (对标 YOLO26m，深度减半为 1)
  # ==========================================
  - [0, 1, Thermal_Stem, [64, 3, 2]]   # 11: P1
  - [-1, 1, Conv, [128, 3, 2]]         # 12: P2
  - [-1, 1, C3k2,[256, False, 0.25]]  # 13: (厚度1) Thermal P2 终点

  - [-1, 1, SPDConv, [256]]            # 14: P3
  - [-1, 1, C3k2, [512, False, 0.25]]  # 15: (厚度1) Thermal P3 终点

  - [-1, 1, SPDConv, [512]]            # 16: P4
  - [-1, 1, C3k2, [512, True]]         # 17: (厚度1) Thermal P4 终点

  - [-1, 1, Conv,[1024, 3, 2]]        # 18: P5
  - [-1, 1, C3k2, [1024, True]]        # 19: (厚度1)
  - [-1, 1, SPPF,[1024, 5, 3, True]]  # 20: Thermal P5 终点

  # ==========================================
  # 融合层 (把 1-10 和 11-20 对应的层合并)
  # ==========================================
  - [[3, 13], 1, CBAMFusion, [256]]             # 21: 融合 P2
  - [[5, 15], 1, CBAMFusion, [512]]             # 22: 融合 P3
#  - [[7, 17], 1, TransformerFusion, [512, 8]]   # 23: 融合 P4
  - [[7, 17], 1, Swin_Transformer_Fusion, [512, 8, 4, 8]]   # 23: 融合 P4   ch,num_heads,depth,window_size
#  - [[10, 20], 1, TransformerFusion, [1024, 16]]# 24: 融合 P5
  - [ [ 10, 20 ], 1, Swin_Transformer_Fusion,[ 1024, 16, 2, 8 ] ]# 24: 融合 P5


head:
  # ==========================================
  # FPN (自顶向下，传递 Transformer 的全局语义)
  # ==========================================
  - [24, 1, nn.Upsample, [None, 2, "bicubic", True]] # 25: 融合P5上采样
  - [[-1, 23], 1, Concat, [1]]                       # 26: 拼接融合P4
  - [-1, 2, C3k2, [512, False]]                      # 27: FPN_P4

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]] # 28: FPN_P4上采样
  - [[-1, 22], 1, Concat, [1]]                       # 29: 拼接融合P3
  - [-1, 2, C3k2, [256, False]]                      # 30: FPN_P3

  - [-1, 1, nn.Upsample, [None, 2, "bicubic", True]] # 31: FPN_P3上采样
  - [[-1, 21], 1, Concat, [1]]                       # 32: 拼接融合P2
  - [-1, 2, C3k2,[128, False]]                      # 33: FPN_P2 (最高清语义) -> **输入给检测头1**

  # ==========================================
  # PANet (自底向上，传递高清边缘细节)
  # ==========================================
  - [-1, 1, Conv, [128, 3, 2]]                       # 34: FPN_P2下采样
  - [[-1, 30], 1, Concat, [1]]                       # 35: 拼接FPN_P3
  - [-1, 2, C3k2, [256, False]]                      # 36: PAN_P3 -> **输入给检测头2**

  - [-1, 1, Conv,[256, 3, 2]]                       # 37: PAN_P3下采样
  - [[-1, 27], 1, Concat, [1]]                       # 38: 拼接FPN_P4
  - [-1, 2, C3k2,[512, False]]                      # 39: PAN_P4 -> **输入给检测头3**

  - [-1, 1, Conv, [512, 3, 2]]                       # 40: PAN_P4下采样
  - [[-1, 24], 1, Concat, [1]]                       # 41: 拼接融合P5
  - [-1, 2, C3k2, [1024, False]]                     # 42: PAN_P5 -> **输入给检测头4**

  # ==========================================
  # 终极 Quad-Head (四头检测)
  # ==========================================
  - [[33, 36, 39, 42], 1, Detect,[nc]]              # 43: P2, P3, P4, P5 完美输出！