# YOLO26x Dual-Stream (RGB+Thermal) with P2 Head and Transformer Fusion
# Target: Drone-based Intelligent Transportation Systems (Tiny Object / RGBT)

nc: 5  # Number of classes (e.g., car, truck, bus, motorcycle, pedestrian)
ch: 4  # Input channels: 3 (RGB) + 1 (Thermal) stacked = 4

scales:
  #[depth_multiple, width_multiple, max_channels]
  x:[1.00, 1.25, 1024] # XLarge scale for RTX 4090

# -----------------------------------------------------------------------
# PHASE 1: DUAL BACKBONES (Parallel RGB and Thermal Feature Extraction)

# SPD-conv Space-to-Depth Convolution
#Strategic Placement: Replace the Downsampling layers in the backbone (the layers that move from P2 → P3 and P3 → P4).
#Updated Backbone Logic:
#Stem (P1): Standard Conv (to keep initial memory low).
#P2 (Stride 4): Standard Conv.
#Downsample to P3: SPD-Conv. (Preserves tiny details for the P3 head).
#Downsample to P4: SPD-Conv. (Preserves details for the Transformer Bottleneck).

#add this class to your ultralytics/nn/modules/block.py
#class SPD(nn.Module):
#    """Space-to-depth layer for YOLO backbones."""
#    def __init__(self, dimension=1):
#        super().__init__()
#        self.d = dimension
#
#    def forward(self, x):
#        # x shape: [B, C, H, W]
#        # Slices the image into 4 pieces and stacks them in channels
#        return torch.cat([
#            x[..., 0::2, 0::2],
#            x[..., 1::2, 0::2],
#            x[..., 0::2, 1::2],
#            x[..., 1::2, 1::2]
#        ], 1)
# -----------------------------------------------------------------------
backbone:
  # [from, repeats, module, args]
  # Custom RGBT modules split the 4ch input and run two YOLO backbones inside.

  - [-1, 1, RGBT_Stem, [64, 3, 2]]       # 0: P1 (Stride 2)
  - [-1, 1, RGBT_Conv, [128, 3, 2]]      # 1: P2 (Stride 4)  <- 160x160 resolution
  - [-1, 2, RGBT_C3k2, [256, False, 0.25]] # 2:

  - [-1, 1, RGBT_Conv,[256, 3, 2]]      # 3: P3 (Stride 8)  <- 80x80 resolution SPD-conv
  - [-1, 2, RGBT_C3k2,[512, False, 0.25]] # 4:

  - [-1, 1, RGBT_Conv, [512, 3, 2]]      # 5: P4 (Stride 16) <- 40x40 resolution SPD-conv
  - [-1, 2, RGBT_C3k2, [512, True]]      # 6:

  - [-1, 1, RGBT_Conv, [1024, 3, 2]]     # 7: P5 (Stride 32) <- 20x20 resolution
  - [-1, 2, RGBT_C3k2, [1024, True]]     # 8:
  - [-1, 1, RGBT_SPPF,[1024, 5, 3, True]] # 9: Global pooling

  # -----------------------------------------------------------------------
  # PHASE 2: FUSION BOTTLENECKS (Bridging the Modalities)
  # -----------------------------------------------------------------------
  # Shallow Fusion (Fast CNN Attention for high-res edges)
  - [2, 1, CBAMFusion, [256]]            # 10: Fused P2 (from Layer 2)
  - [4, 1, CBAMFusion, [512]]            # 11: Fused P3 (from Layer 4)

  # Deep Fusion (Transformer Reasoner for global context & weather adaptation)
  - [6, 1, TransformerFusion, [512, 8]]  # 12: Fused P4 (from Layer 6) transferred learning
  - [9, 1, TransformerFusion, [1024, 16]]# 13: Fused P5 (from Layer 9)

# -----------------------------------------------------------------------
# PHASE 3: NECK (FPN + PANet) & HEAD
# -----------------------------------------------------------------------
head:
  # --- FPN: Top-Down (Sharing Intelligence DOWN to P2) ---
  - [13, 1, nn.Upsample,[None, 2, "nearest"]] # 14: P5 moves up 不用nearest CARAFE (Content-Aware ReAssembly of FEatures)
  - # / bilinear / The Runner Up: Pixel Shuffle (Sub-Pixel Convolution) / The Solid Baseline: Bicubic Upsampling
  - [[-1, 12], 1, Concat, [1]]                 # 15: Merge with Fused P4
  - [-1, 2, C3k2, [512, False]]                # 16: FPN_P4

  - [-1, 1, nn.Upsample,[None, 2, "nearest"]] # 17: P4 moves up
  - [[-1, 11], 1, Concat, [1]]                 # 18: Merge with Fused P3
  - [-1, 2, C3k2, [256, False]]                # 19: FPN_P3

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 20: P3 moves up
  - [[-1, 10], 1, Concat, [1]]                 # 21: Merge with Fused P2
  - [-1, 2, C3k2, [128, False]]                # 22: FPN_P2 (Max Sharpness + Intelligence)

  # --- PANet: Bottom-Up (Sharing Sharpness UP to P5) ---
  - [-1, 1, Conv, [128, 3, 2]]                 # 23: P2 moves down (Stride 2)
  - [[-1, 19], 1, Concat, [1]]                 # 24: Merge with FPN_P3
  - [-1, 2, C3k2, [256, False]]                # 25: PAN_P3

  - [-1, 1, Conv, [256, 3, 2]]                 # 26: P3 moves down (Stride 2)
  - [[-1, 16], 1, Concat, [1]]                 # 27: Merge with FPN_P4
  - [-1, 2, C3k2, [512, False]]                # 28: PAN_P4

  - [-1, 1, Conv,[512, 3, 2]]                 # 29: P4 moves down (Stride 2)
  - [[-1, 13], 1, Concat, [1]]                 # 30: Merge with Fused P5
  - [-1, 2, C3k2,[1024, False]]               # 31: PAN_P5

  # --- DETECTION HEAD (4 Scales) ---
  # P2 (Stride 4): Tiny Objects (<32x32) 需要修改，原YOLOv26x头仅有P3,P4,P5
  # P3 (Stride 8): Small Objects
  # P4 (Stride 16): Medium Objects
  # P5 (Stride 32): Large Objects
  - [[22, 25, 28, 31], 1, Detect, [nc]]        # 32: Final Detection Output